Revit 2027 API
ParameterUtils.IsValidRegionCode Method
 Checks whether a given region code is allowed to identify a region where an account containing parameter definitions may exist.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidRegionCode(
	string region
)
Public Shared Function IsValidRegionCode (
	region As String
) As Boolean
public:
static bool IsValidRegionCode(
	String^ region
)
static member IsValidRegionCode :
        region : string -> bool
Parameters
region String
 The region to check.
Return Value
Boolean
 False if the region is invalid, true otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 In order to support new regions in the future, this method does not use a fixed list. Supported regions include "US", "EMEA", "IRL", "APAC", "AUS", "GBR", "DEU", "JPN", "CAN", and "IND". A return value of true does not indicate that a given region actually exists.
See Also
Reference
ParameterUtils Class
Autodesk.Revit.DB Namespace